rottenpotatoes/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "\"Devin\""]]
---
  def director
    @director = params[:director]
    @movies = Movie.where(director: @director)